[
  {
    "name": "Sharad Purnima",
    "date": "2025-10-06",
    "type": "Hindu",
    "emoji": "🌕",
    "description": "Sharad Purnima, the auspicious autumn full moon, is observed with late-night devotional singing, moonlit offerings, and cooling kheer, symbolizing divine grace, seasonal transition, wellness beliefs, and gratitude for abundance during the harvest’s early stages."
  },
  {
    "name": "Karwa Chauth",
    "date": "2025-10-10",
    "type": "Hindu",
    "emoji": "🌙",
    "description": "Karwa Chauth features a sunrise-to-moonrise fast primarily observed by married women for partners’ well-being, including sargi before dawn, evening puja, viewing the moon through a sieve, and festive meals shared with family, reaffirming bonds and devotion."
  },
  {
    "name": "Dhanteras",
    "date": "2025-10-18",
    "type": "Hindu",
    "emoji": "💰",
    "description": "Dhanteras opens the Diwali festivities with worship of Dhanvantari and Lakshmi, auspicious purchases of metals or utensils, home purification, lighting diyas, and prayers for health, prosperity, and fortune to usher in a prosperous new period."
  },
  {
    "name": "Kali Chaudas (Narak Chaturdashi)",
    "date": "2025-10-19",
    "type": "Hindu",
    "emoji": "🔥",
    "description": "Kali Chaudas focuses on cleansing rituals, oil baths, early morning prayers, and protective traditions symbolically destroying negativity before Diwali’s main day, preparing homes and hearts for light, prosperity, and auspicious new beginnings with renewed energy."
  },
  {
    "name": "Diwali (Lakshmi Puja)",
    "date": "2025-10-20",
    "type": "Hindu",
    "emoji": "🪔",
    "description": "Diwali celebrates the victory of light over darkness with Lakshmi-Ganesha puja, diyas, rangoli, sweets, gifts, and family gatherings, renewing prosperity and unity across communities while emphasizing gratitude, charity, and joyful cultural expressions nationwide."
  },
  {
    "name": "Govardhan Puja (Annakut)",
    "date": "2025-10-22",
    "type": "Hindu",
    "emoji": "🥣",
    "description": "Govardhan Puja honors Krishna’s protection by preparing Annakut offerings, arranging many dishes in temples, and expressing gratitude for nature’s bounty, seeking continued shelter, harmony, and blessings for community well-being and environmental balance."
  },
  {
    "name": "Bhai Dooj",
    "date": "2025-10-23",
    "type": "Hindu",
    "emoji": "🧿",
    "description": "Bhai Dooj celebrates sibling bonds with tilak ceremonies, blessings, gift exchanges, and festive meals, reinforcing affection, protection, and mutual support, concluding Diwali’s series of auspicious days with family-centered rituals and heartfelt togetherness."
  },
  {
    "name": "Chhath Puja",
    "date": "2025-10-27",
    "type": "Hindu",
    "emoji": "🌅",
    "description": "Chhath Puja venerates the Sun and Chhathi Maiya with rigorous fasting, riverbank offerings at sunrise and sunset, and purity observances, especially in Bihar, Uttar Pradesh, and Jharkhand, emphasizing gratitude, discipline, and ecological reverence."
  },
  {
    "name": "Guru Nanak Jayanti (Gurpurab)",
    "date": "2025-11-05",
    "type": "Sikh",
    "emoji": "🛕",
    "description": "Guru Nanak Jayanti honors the birth of Guru Nanak with Akhand Path recitations, Nagar Kirtan processions, illuminated gurdwaras, and community langar, spreading teachings of equality, humility, service, and devotion that guide spiritual and social life."
  },
  {
    "name": "Christmas",
    "date": "2025-12-25",
    "type": "Christian",
    "emoji": "🎄",
    "description": "Christmas commemorates the birth of Jesus Christ through midnight Mass, carols, nativity scenes, decorations, and charity, bringing communities together with hope and goodwill, and reflecting messages of compassion, joy, and renewed spiritual commitment."
  }
]
